In [9]:
try:
    f=open('data1.csv','x')
    f.close()
except:
    print("The file is already created!")

The file is already created!

In [6]:
import pandas as pd
df=pd.read_csv('data1.csv',nrows=4)
df

   sn   name  age         add        phone
0   1    Ram   34   Kathmandu   9808778765
1   2  Shyam   54  Bhaktapuer  98098778765
2   3   Hari   32    Lalitpur   9808778765
3   4  Sabin   45       Jhapa   9808778765

In [9]:
import pandas as pd
df=pd.read_csv('data1.csv')
df.head(4)

   sn   name  age         add        phone
0   1    Ram   34   Kathmandu   9808778765
1   2  Shyam   54  Bhaktapuer  98098778765
2   3   Hari   32    Lalitpur   9808778765
3   4  Sabin   45       Jhapa   9808778765

In [6]:
import pandas as pd
df=pd.read_csv('data1.csv')
df.tail()

   sn    name  age         add        phone
1   2   Shyam   54  Bhaktapuer  98098778765
2   3    Hari   32    Lalitpur   9808778765
3   4   Sabin   45       Jhapa   9808778765
4   5   Nabin   56     Chitwan   9808778765
5   6  Sabina   33   Kathmandu   9808889876

In [7]:
import pandas as pd
df=pd.read_csv('data1.csv')
df.tail(4)

   sn    name  age        add       phone
2   3    Hari   32   Lalitpur  9808778765
3   4   Sabin   45      Jhapa  9808778765
4   5   Nabin   56    Chitwan  9808778765
5   6  Sabina   33  Kathmandu  9808889876

In [9]:
df=pd.read_csv('data1.csv',usecols=['sn','name','age'])
df

   sn    name  age
0   1     Ram   34
1   2   Shyam   54
2   3    Hari   32
3   4   Sabin   45
4   5   Nabin   56
5   6  Sabina   33

In [11]:
df=pd.read_csv('data1.csv',index_col='sn')
df

      name  age         add        phone
sn
1      Ram   34   Kathmandu   9808778765
2    Shyam   54  Bhaktapuer  98098778765
3     Hari   32    Lalitpur   9808778765
4    Sabin   45       Jhapa   9808778765
5    Nabin   56     Chitwan   9808778765
6   Sabina   33   Kathmandu   9808889876

In [12]:
df[['name','add']]

      name         add
sn
1      Ram   Kathmandu
2    Shyam  Bhaktapuer
3     Hari    Lalitpur
4    Sabin       Jhapa
5    Nabin     Chitwan
6   Sabina   Kathmandu

In [16]:
df[['name','age']]

      name  age
sn
1      Ram   34
2    Shyam   54
3     Hari   32
4    Sabin   45
5    Nabin   56
6   Sabina   33

In [17]:
df=pd.read_csv('data1.csv')
df[['sn','age']]

   sn  age
0   1   34
1   2   54
2   3   32
3   4   45
4   5   56
5   6   33

In [18]:
#iloc loc

In [19]:
df.iloc[2:5]

   sn   name  age       add       phone
2   3   Hari   32  Lalitpur  9808778765
3   4  Sabin   45     Jhapa  9808778765
4   5  Nabin   56   Chitwan  9808778765

In [20]:
df.iloc[2:3]

   sn  name  age       add       phone
2   3  Hari   32  Lalitpur  9808778765

In [21]:
df.loc[2:5]

   sn    name  age        add       phone
2   3    Hari   32   Lalitpur  9808778765
3   4   Sabin   45      Jhapa  9808778765
4   5   Nabin   56    Chitwan  9808778765
5   6  Sabina   33  Kathmandu  9808889876

In [23]:
df.loc[2:3]

   sn   name  age       add       phone
2   3   Hari   32  Lalitpur  9808778765
3   4  Sabin   45     Jhapa  9808778765

In [24]:
df

   sn    name  age         add        phone
0   1     Ram   34   Kathmandu   9808778765
1   2   Shyam   54  Bhaktapuer  98098778765
2   3    Hari   32    Lalitpur   9808778765
3   4   Sabin   45       Jhapa   9808778765
4   5   Nabin   56     Chitwan   9808778765
5   6  Sabina   33   Kathmandu   9808889876

In [25]:
df['name']

0       Ram
1     Shyam
2      Hari
3     Sabin
4     Nabin
5    Sabina
Name: name, dtype: object

In [26]:
df['name']=='Ram'

0     True
1    False
2    False
3    False
4    False
5    False
Name: name, dtype: bool

In [27]:
df[df['name']=='Ram']

   sn name  age        add       phone
0   1  Ram   34  Kathmandu  9808778765

In [31]:
df[df['age']<35]

   sn    name  age        add       phone
0   1     Ram   34  Kathmandu  9808778765
2   3    Hari   32   Lalitpur  9808778765
5   6  Sabina   33  Kathmandu  9808889876

In [32]:
df[df['age']>35]

   sn   name  age         add        phone
1   2  Shyam   54  Bhaktapuer  98098778765
3   4  Sabin   45       Jhapa   9808778765
4   5  Nabin   56     Chitwan   9808778765

In [37]:
df[(df['age']>35) & (df['name']=='Nabin')]

   sn   name  age      add       phone
4   5  Nabin   56  Chitwan  9808778765

In [41]:
#dictionary to dataframe

In [46]:
data={'name':['ram','shyam','Hari'],'age':[36,37,38],'add':['ktm','ptn','bkt']}
df=pd.DataFrame(data)
df

    name  age  add
0    ram   36  ktm
1  shyam   37  ptn
2   Hari   38  bkt

In [52]:
df.to_csv('info.csv')

In [55]:
import os
files=os.listdir()
if 'info.csv' in files:
    print('yes')
else:
    print('No')

yes

In [54]:
pwd

'C:\\Users\\User\\python class\\file handling'

In [57]:
import datetime
date=datetime.datetime.now()
print(date)

2023-11-30 04:40:26.157518

In [58]:
import datetime
date=datetime.datetime.now()
print(str(date))

2023-11-30 04:40:59.859129

In [59]:
#list inside list to csv file

In [65]:
import csv
data=[['Ram',34,'patan'],
      ['Ram',35,'ktm'],
      ['Hari',36,'ptn']]
file = open('new_info.csv','w')
x=csv.writer(file)
x.writerows(data)
file.close()

In [68]:
import csv

csv_columns = ['Name', 'Age', 'Address']

dict = [

{'Name':'Aayush','Age':23,'Address':'Katmandu'},

{'Name':'Shyam','Age':33,'Address':'Patan'}

]

csvfile=open("data.csv",'w')
writer=csv.DictWriter(csvfile,fieldnames=csv_columns)
writer.writeheader()
for data in dict:
    writer.writerow(data)

csvfile.close()